Revit 2027 API
Ceramic.CeramicType Property
 The property labeled "Type" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string CeramicType { get; }
Public Shared ReadOnly Property CeramicType As String
	Get
public:
static property String^ CeramicType {
	String^ get ();
}
static member CeramicType : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicType".
See Also
Reference
Ceramic Class
Autodesk.Revit.DB.Visual Namespace